## Подгружаем библиотеки

In [1]:
import pandas as pd
from sqlalchemy import create_engine

## PostgresSQL
POSTGRES_PORT=5432

POSTGRES_HOST=Localhost

POSTGRES_USER=postgres

POSTGRES_DB=monero-payer

POSTGRES_PASSWORD=postgres

In [2]:

conn = create_engine('postgresql://postgres:postgres@localhost:5432/monero-payer')

## Тестовая таблица

In [3]:
data_table = pd.read_sql_table('test_table', conn)
data_table

   id      test_dt
0   1  Hello World

In [4]:
data_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       1 non-null      int64
 1   test_dt  1 non-null      object
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

## Таблица accounts

In [9]:
data_table_accounts = pd.read_sql_table('accounts', conn)
data_table_accounts

,id,address,in_use,last_issued_at,created_at,updated_at
0,0,A000000000000000000000000000000000000000000000...,True,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769
1,1,A000000000000000000000000000000000000000000000...,True,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769
2,2,B000000000000000000000000000000000000000000000...,False,NaT,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769
3,3,D000000000000000000000000000000000000000000000...,False,NaT,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769
4,4,D000000000000000000000000000000000000000000000...,False,NaT,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769
5,16,Bdus7MGeYCBYFGLGYJbcvYYTHQpU1prrfMqefuUDVMRa3f...,False,NaT,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769
6,17,BgXzntikCzHTyuQJkbKa3bCnmo5WBqFBoGVcAGC8Y2g1GX...,False,NaT,2022-04-28 08:48:37.210769,2022-04-28 08:48:37.210769

In [6]:
data_table_accounts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              10 non-null     int64
 1   address         10 non-null     object
 2   in_use          10 non-null     bool
 3   last_issued_at  2 non-null      datetime64[ns]
 4   created_at      10 non-null     datetime64[ns]
 5   updated_at      10 non-null     datetime64[ns]
dtypes: bool(1), datetime64[ns](3), int64(1), object(1)
memory usage: 538.0+ bytes

In [7]:
data_table_accounts [['address', 'in_use']]

                                             address  in_use
0  A000000000000000000000000000000000000000000000...    True
1  A000000000000000000000000000000000000000000000...    True
2  B000000000000000000000000000000000000000000000...   False
3  D000000000000000000000000000000000000000000000...   False
4  D000000000000000000000000000000000000000000000...   False
5                                            1232412   False
6                                            1232131   False
7                                           12232131   False
8  Bdus7MGeYCBYFGLGYJbcvYYTHQpU1prrfMqefuUDVMRa3f...   False
9  BgXzntikCzHTyuQJkbKa3bCnmo5WBqFBoGVcAGC8Y2g1GX...   False

In [8]:
print('Task %s done' % 5)

Task 5 done